In [1]:
# Queries

import pandas as pd
import sqlite3

conn = sqlite3.connect("/Users/thomassimmons/Downloads/chinook-database-master/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite")

In [4]:
pd.read_sql("""SELECT FirstName, LastName, Country
            FROM Customer
            WHERE Country = 'USA';
            """, conn)

   FirstName    LastName Country
0      Frank      Harris     USA
1       Jack       Smith     USA
2   Michelle      Brooks     USA
3        Tim       Goyer     USA
4        Dan      Miller     USA
5      Kathy       Chase     USA
6    Heather     Leacock     USA
7       John      Gordon     USA
8      Frank     Ralston     USA
9     Victor     Stevens     USA
10   Richard  Cunningham     USA
11   Patrick        Gray     USA
12     Julia     Barnett     USA

In [2]:
pd.read_sql("PRAGMA table_info", conn)

Empty DataFrame
Columns: [cid, name, type, notnull, dflt_value, pk]
Index: []

In [5]:
pd.read_sql("""SELECT COUNT(*) AS total_invoices
            FROM Invoice;""", conn)

   total_invoices
0             412